app/views/stronas/index.html.erb

    <td class="center"><%= status_widoku(strona.widoczna)%></td>
    <td class="center"><%= strona.artykuls.size %></td>
---
SELECT COUNT(*) FROM "artykuls" WHERE "artykuls"."strona_id" = ?  [["strona_id", 1]]