app/views/galeries/index.html.erb

    <td class="center"><%= status_widoku(galerie.widoczna)%></td>
    <td class="center"><%= galerie.zdjecies.size%></td>
---
SELECT COUNT(*) FROM "zdjecies" WHERE "zdjecies"."galerie_id" = ?  [["galerie_id", 1]]