app/controllers/artykuls_controller.rb

SELECT "stronas".* FROM "stronas" ORDER BY pozycja ASC
SELECT COUNT(*) FROM "artykuls"
---
  def nowy
    @artykuly = Artykul.new(:nazwa => "Tytuł?")
    @strona = Strona.order('pozycja ASC')
    @licznik = Artykul.count + 1

INSERT INTO "artykuls" ("strona_id", "nazwa", "pozycja", "zawartosc", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["strona_id", 1], ["nazwa", "Kolejny artykuł..."], ["pozycja", 1], ["zawartosc", ""], ["created_at", "2018-11-01 08:19:00"], ["updated_at", "2018-11-01 08:20:49.889132"]]
---
  def utworz
    @artykuly = Artykul.new(artykuly_parametry)
    if @artykuly.save

SELECT  "artykuls".* FROM "artykuls" WHERE "artykuls"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "stronas".* FROM "stronas" ORDER BY pozycja ASC
SELECT COUNT(*) FROM "artykuls"
---
  def edycja
    @artykuly = Artykul.find(params[:id])
    @strona = Strona.order('pozycja ASC')
    @licznik = Artykul.count

SELECT  "artykuls".* FROM "artykuls" WHERE "artykuls"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "artykuls" SET "strona_id" = ?, "nazwa" = ?, "updated_at" = ? WHERE "artykuls"."id" = ?  [["strona_id", 2], ["nazwa", "Artykul 2"], ["updated_at", "2018-11-01 07:22:20.851659"], ["id", 2]]
---
  def aktualizuj
    @artykuly = Artykul.find(params[:id])
    if @artykuly.update_attributes(artykuly_parametry)

SELECT  "artykuls".* FROM "artykuls" WHERE "artykuls"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def usun
    @artykuly = Artykul.find(params[:id])

DELETE FROM "artykuls" WHERE "artykuls"."id" = ?  [["id", 1]]
SELECT  "artykuls".* FROM "artykuls" WHERE "artykuls"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def kasuj
    artykuly = Artykul.find(params[:id]).destroy

SELECT  "artykuls".* FROM "artykuls" WHERE "artykuls"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def pokaz
    @artykuly = Artykul.find(params[:id])

SELECT  "stronas".* FROM "stronas" WHERE "stronas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def szukaj_strony
    if params[:strona_id]
      @strony = Strona.find(params[:strona_id])