app/controllers/dostep_controller.rb

  def logowanie
    if params[:uzytkownik].present? && params[:haslo].present?
      admin_szukam = Uzytkownik.where(:uzytkownik => params[:uzytkownik]).first
---
SELECT  "uzytkowniks".* FROM "uzytkowniks" WHERE "uzytkowniks"."uzytkownik" = ? ORDER BY "uzytkowniks"."id" ASC LIMIT ?  [["uzytkownik", "Kajcyk"], ["LIMIT", 1]]