app/controllers/galeries_controller.rb

  def nowa
    @galeria = Galerie.new({:nazwa => "Wprowadź nazwę"})
    @licznik = Galerie.count + 1
---
SELECT COUNT(*) FROM "galeries"

  def utworz
    @galeria = Galerie.new(galeria_parametry)
    if @galeria.save
---
INSERT INTO "galeries" ("nazwa", "pozycja", "opis", "widoczna", "zdjecie_file_name", "zdjecie_content_type", "zdjecie_file_size", "zdjecie_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def pokaz
    @galeria = Galerie.find(params[:id])
---
SELECT  "galeries".* FROM "galeries" WHERE "galeries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edycja
    @galeria = Galerie.find(params[:id])
    @licznik = Galerie.count
---
SELECT  "galeries".* FROM "galeries" WHERE "galeries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "galeries"

  def aktualizuj
    @galeria = Galerie.find(params[:id])
    if @galeria.update_attributes(galeria_parametry)
---
SELECT  "galeries".* FROM "galeries" WHERE "galeries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "galeries" SET "nazwa" = ?, "widoczna" = ?, "updated_at" = ? WHERE "galeries"."id" = ?  [["nazwa", "Nowa galeria z kwiatami"], ["widoczna", 1], ["updated_at", "2018-11-01 08:59:30.315142"], ["id", 1]]

  def usun
    @galeria = Galerie.find(params[:id])
---
SELECT  "galeries".* FROM "galeries" WHERE "galeries"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def kasuj
    galeria = Galerie.find(params[:id]).destroy
---
DELETE FROM "galeries" WHERE "galeries"."id" = ?  [["id", 4]]
SELECT  "galeries".* FROM "galeries" WHERE "galeries"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]