app/controllers/kategories_controller.rb

SELECT  "kategories".* FROM "kategories" WHERE "kategories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def pokaz
    @kategoria = Kategorie.find(params[:id])

SELECT COUNT(*) FROM "kategories"
---
  def nowa
    @kategoria = Kategorie.new({:nazwa => "Podaj nazwę kategorii"})
    @licznik = Kategorie.count + 1

INSERT INTO "kategories" ("nazwa", "pozycja", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nazwa", "Pierwsza kategoria"], ["pozycja", 1], ["created_at", "2018-10-31 19:28:00"], ["updated_at", "2018-10-31 19:28:36.399946"]]
---
  def utworz
    @kategorie = Kategorie.new(kategorie_parametry)
    if @kategorie.save