app/controllers/public_controller.rb

SELECT  "stronas".* FROM "stronas" WHERE "stronas"."widoczna" = ? ORDER BY "stronas"."id" DESC LIMIT ?  [["widoczna", 1], ["LIMIT", 3]]
SELECT  "artykuls".* FROM "artykuls" WHERE "artykuls"."widoczny" = ? ORDER BY "artykuls"."id" DESC LIMIT ?  [["widoczny", 1], ["LIMIT", 3]]
SELECT  "galeries".* FROM "galeries" WHERE "galeries"."widoczna" = ? ORDER BY "galeries"."id" DESC LIMIT ?  [["widoczna", 1], ["LIMIT", 3]]
---
  def index
    @strona = Strona.where(:widoczna => true).last(3)
    @artykuly = Artykul.where(:widoczny => true).last(3)
    @galerie = Galerie.where(:widoczna => true).last(3)

SELECT  "stronas".* FROM "stronas" WHERE "stronas"."widoczna" = ? ORDER BY "stronas"."id" DESC LIMIT ?  [["widoczna", 1], ["LIMIT", 10]]
---
  def artykuly
    @strona_menu = Strona.where(:widoczna => true).last(10)

SELECT  "galeries".* FROM "galeries" WHERE "galeries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def galerie
    @galeria = Galerie.find(params[:galeria_id])

SELECT  "kategories".* FROM "kategories" WHERE "kategories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def kategorie
    @kategoria = Kategorie.find(params[:kategoria_id])

SELECT  "artykuls".* FROM "artykuls" WHERE "artykuls"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def nowosci
    @artykul = Artykul.find(params[:artykul_id])

SELECT  "stronas".* FROM "stronas" WHERE "stronas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def strona
    @strona = Strona.find(params[:strona_id])