app/controllers/stronas_controller.rb

  def pokaz
    @strona = Strona.find(params[:id])
---
SELECT  "stronas".* FROM "stronas" WHERE "stronas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def nowa
    @strona = Strona.new({:kategorie_id => @kategorie.id, :nazwa => "Podaj nazwę strony"})
    @kategoria = Kategorie.order('pozycja ASC')
    @licznik = Strona.count + 1
---
SELECT "kategories".* FROM "kategories" ORDER BY pozycja ASC
SELECT COUNT(*) FROM "stronas"

  def utworz
    @strona = Strona.new(strona_parametry)
    if @strona.save
---
INSERT INTO "stronas" ("kategorie_id", "nazwa", "pozycja", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["kategorie_id", 1], ["nazwa", "Pierwsza strona"], ["pozycja", 1], ["created_at", "2018-10-31 21:11:00"], ["updated_at", "2018-10-31 21:11:38.553562"]]

  def edycja
    @strona = Strona.find(params[:id])
    @kategoria = Kategorie.order('pozycja ASC')
    @licznik = Strona.count
---
SELECT  "stronas".* FROM "stronas" WHERE "stronas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "kategories".* FROM "kategories" ORDER BY pozycja ASC
SELECT COUNT(*) FROM "stronas"

  def aktualizuj
    @strona = Strona.find(params[:id])
    if @strona.update_attributes(strona_parametry)
      flash[:notice] = "Strona została pomyślnie zmodyfikowana"
      redirect_to(:action => 'pokaz', :id => @strona.id, :kategoria_id => @kategorie.id)
    else@kategorie = Kategorie.find(params[:kategoria_id])
---
SELECT  "stronas".* FROM "stronas" WHERE "stronas"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "stronas" SET "pozycja" = ?, "updated_at" = ? WHERE "stronas"."id" = ?  [["pozycja", 3], ["updated_at", "2018-10-31 21:17:37.499622"], ["id", 3]]
SELECT  "kategories".* FROM "kategories" WHERE "kategories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def szukaj_kategorie
    if params[:kategoria_id]
      @kategorie = Kategorie.find(params[:kategoria_id])
---
SELECT  "kategories".* FROM "kategories" WHERE "kategories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]