app/controllers/uzytkowniks_controller.rb

INSERT INTO "uzytkowniks" ("imie", "nazwisko", "uzytkownik", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def utworz
    @uzytkownik = Uzytkownik.new(uzytkownik_parametry)
    if @uzytkownik.save