app/controllers/zdjecies_controller.rb

SELECT COUNT(*) FROM "zdjecies"
SELECT "galeries".* FROM "galeries" ORDER BY pozycja ASC
---
  def nowe
    @zdjecia = Zdjecie.new({:nazwa => "Wprowadź nazwę zdjęcia", :galerie_id => @galerie.id})
    @licznik = Zdjecie.count + 1
    @galeria = Galerie.order('pozycja ASC')

INSERT INTO "zdjecies" ("galerie_id", "nazwa", "pozycja", "opis", "zdjecie_file_name", "zdjecie_content_type", "zdjecie_file_size", "zdjecie_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def utworz
    @zdjecia = Zdjecie.new(zdjecia_parametry)
    if @zdjecia.save

SELECT  "zdjecies".* FROM "zdjecies" WHERE "zdjecies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def pokaz
    @zdjecia = Zdjecie.find(params[:id])

SELECT  "zdjecies".* FROM "zdjecies" WHERE "zdjecies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "zdjecies"
SELECT "galeries".* FROM "galeries" ORDER BY pozycja ASC
---
  def edycja
    @zdjecia = Zdjecie.find(params[:id])
    @licznik = Zdjecie.count
    @galeria = Galerie.order('pozycja ASC')

SELECT  "zdjecies".* FROM "zdjecies" WHERE "zdjecies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "zdjecies" SET "nazwa" = ?, "updated_at" = ? WHERE "zdjecies"."id" = ?  [["nazwa", "Zaczarowany ogród "], ["updated_at", "2018-11-01 10:54:44.358864"], ["id", 2]]
---
  def aktualizuj
    @zdjecia = Zdjecie.find(params[:id])
    if @zdjecia.update_attributes(zdjecia_parametry)

SELECT  "galeries".* FROM "galeries" WHERE "galeries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def szukaj_galerie
    if params[:galerie_id]
      @galerie = Galerie.find(params[:galerie_id])