app/views/kategories/index.html.erb

SELECT COUNT(*) FROM "stronas" WHERE "stronas"."kategorie_id" = ?  [["kategorie_id", 1]]
---
    <td class="center"><%= status_widoku(kategoria.widoczna)%></td>
    <td class="center"><%= kategoria.stronas.size %></td>