app/views/public/_menu.html.erb

SELECT  "galeries".* FROM "galeries" WHERE "galeries"."widoczna" = ? ORDER BY "galeries"."id" DESC LIMIT ?  [["widoczna", 1], ["LIMIT", 10]]
---
              <ul class="dropdown-menu">
                  <% galeria_menu   = Galerie.where(:widoczna => true).last(10) %>

SELECT  "kategories".* FROM "kategories" WHERE "kategories"."widoczna" = ? ORDER BY "kategories"."id" DESC LIMIT ?  [["widoczna", 1], ["LIMIT", 10]]
---
              <ul class="dropdown-menu">
                  <% kategoria_menu   = Kategorie.where(:widoczna => true).last(10) %>