app/views/public/galerie.html.erb

  <div class="row">
    <% @galeria.zdjecies.each do |zdjecie| %>
---
SELECT "zdjecies".* FROM "zdjecies" WHERE "zdjecies"."galerie_id" = ?  [["galerie_id", 1]]