app/views/public/kategorie.html.erb

SELECT "stronas".* FROM "stronas" WHERE "stronas"."kategorie_id" = ? AND "stronas"."widoczna" = ? ORDER BY stronas.pozycja ASC  [["kategorie_id", 2], ["widoczna", 1]]
---
    <h2>Lista stron kategorii: <%= @kategoria.nazwa %></h2>
      <% @kategoria.stronas.widoczna.sortuj.each do |strona| %>