app/views/public/strona.html.erb

SELECT "artykuls".* FROM "artykuls" WHERE "artykuls"."strona_id" = ? AND "artykuls"."widoczny" = ? ORDER BY artykuls.pozycja ASC  [["strona_id", 1], ["widoczny", 1]]
---
    <h2><%= @strona_nazwa %></h2>
    <% @strona.artykuls.widoczny.sortuj.each do |artykul| %>